---
kind: property
id: P:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.IsEmpty
source: html/6bcc758a-87d3-9046-4a00-6a1453b126f2.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.